// 🧩 ЧАСТИНА 1

/*
ЗАВДАННЯ 1:

Створити об'єкти game (гра), який має властивості:
  - size (розмір) -> значення: число (наприклад, 4)
  - attempts (спроби) -> значення: число (для початку 0)

Після створення об'єкта:
  - змінити значення поля attempts на (size * 2)
  - додати нове поле matrix (матриця) -> значення: порожній масив

Вивести у консоль (у браузері):
  - game.size
  - game.attempts
  - game.matrix
*/



// 🧩 ЧАСТИНА 2

/*
ЗАВДАННЯ 2:

Створити об'єкти elements (елементи), який має властивості:
  - message (розмір) -> значення: елемент з id="message"
  - map (мапа) -> значення: елемент з id="map"
  - attempts (спроби) -> значення: елемент з id="attempts"
  
  та методи:
  
  - updateAttempts() -> змінює внутр. текcт this.attempts на значення game.attempts
  - winMessage() -> змінює внутр. текcт this.message на "Вітаю! Ви знайшли скарб! 🎉" 
                    та колір тексту на "yellowgreen"
  - loseMessage() -> змінює внутр. текcт this.message на "У вас закінчилися спроби 😢"
                     та колір тексту на "crimson"

Після створення об'єкта:
  - викликати метод updateAttempts()
  - викликати метод winMessage()

Вивести у консоль (у браузері):
  - elements.message
  - elements.map
  - elements.attempts
*/



// 🧩 ЧАСТИНА 3

/*
ЗАВДАННЯ 3:

Створити об'єкти treasure (скарб), який має властивості:
  - row (рядок) -> значення: Math.floor(Math.random() * game.size)
  - col (стовпчик) -> значення: Math.floor(Math.random() * game.size)
  - emoji (емодзі) -> значення: "💎"

Після створення об'єкта:
  - змінити емодзі на "👑"

Вивести у консоль (у браузері):
  - treasure.row
  - treasure.col
  - treasure.emoji
*/



// ✨ ЧАСТИНА 4

/*
Розкоментуйте код нижче.
Якщо ви правильно виконали всі три завдання:
  - на екрані з'явиться ігрове поле розміром size x size
  - в одній з клітинок буде "👑"
*/

// for (let i = 0; i < game.size; i++) {
//   const row = document.createElement("div");
//   row.classList.add("row");
//   const matrixRow = [];

//   for (let j = 0; j < game.size; j++) {
//     const cell = document.createElement("div");
//     cell.classList.add("cell");
//     row.appendChild(cell);
//     matrixRow.push(cell);
//   }

//   elements.map.appendChild(row);
//   game.matrix.push(matrixRow);
// }

// game.matrix[treasure.row][treasure.col].innerText = treasure.emoji;
